snappy_pipe_potential/0.orig/U
 /*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.0001);

boundaryField
{
    topPatch
    { 
        type            zeroGradient;
    }

    Wall
    {
        type            noSlip;
    }

    bottomPatch
    {
        type            fixedValue;
        value           uniform (0 0 0.0001);
    }
}

// ************************************************************************* //
